docs(flowchart): update flowchart for more clarity
docs: add label
